app/views/home/search_tutor.html.erb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."start_time" = ? AND "schedules"."active" = ?  [["start_time", "2020-10-19 10:00:00"], ["active", 1]]
---
<div class="container">
	<% Schedule.where(start_time: params[:start_time], active: 1).each do |s| %>