app/views/home/search_reservation.html.erb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."tutor_id" = ? AND "schedules"."applied" = ?  [["tutor_id", 1], ["applied", 1]]
---
<div class="container">
	<% Schedule.where(tutor_id: params[:tutor_id], applied: true).each do |s| %>