app/controllers/home_controller.rb

SELECT "schedules".* FROM "schedules"
---
  def index
	  @post = Schedule.all

INSERT INTO "schedules" ("tutor_id", "start_time", "active", "applied", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tutor_id", 1], ["start_time", "2020-10-19 10:00:00"], ["active", 1], ["applied", 0], ["created_at", "2022-07-03 18:31:15.495866"], ["updated_at", "2022-07-03 18:31:15.495866"]]
---
  def create
	  @post= Schedule.new
	  @post.tutor_id = params[:tutor_id]
	  @post.start_time = params[:start_time]
	  @post.active = params[:active]
	  @post.applied = false
	  @post.save

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "schedules" SET "active" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["active", 1], ["updated_at", "2022-07-03 19:55:39.588841"], ["id", 1]]
---
  def update
	  @post = Schedule.find(params[:id])
	  @post.tutor_id = params[:tutor_id]
	  @post.start_time = params[:start_time]
	  @post.active = params[:active]
	  @post.applied = params[:applied]
	  @post.save

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 2]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def delete
	  Schedule.find(params[:id]).destroy

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update_form
	  @post = Schedule.find(params[:id])

SELECT "schedules".* FROM "schedules" WHERE "schedules"."tutor_id" = ? AND "schedules"."start_time" = ? LIMIT ?  [["tutor_id", 1], ["start_time", "2020-10-19 11:30:00"], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."tutor_id" = ? AND "schedules"."start_time" = ? LIMIT ?  [["tutor_id", 1], ["start_time", "2025-09-23 11:30:00"], ["LIMIT", 1]]
UPDATE "schedules" SET "active" = ?, "time_option" = ?, "applied" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["active", 2], ["time_option", 40], ["applied", 1], ["updated_at", "2022-07-04 11:49:32.234973"], ["id", 19]]
---
  def apply
	  @post = Schedule.find_by(tutor_id: params[:tutor_id], start_time: params[:start_time])
	  @exist = Schedule.find_by(tutor_id: params[:tutor_id], start_time: (params[:start_time].to_datetime + (30/1440.0)))
	  # if @exist.nil?
	  # redirect_to "/home/apply_fail"
	  # else
	  # redirect_to "/"
	  # end

	  if @post.nil?
		  redirect_to "/home/fail" and return
	  end

	  if !@post.nil?
		  if @post.active==1
			  if !@exist.nil?
				  if params[:time_option]==20
					  @post.time_option = params[:time_option]
					  @post.active = 2
					  @post.applied = true
					  @post.save